apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/debug.h>
#include <sys/param.h>

#include "xtensa.h"
#include "esp_gpio.h"
#include "esp32s3_psram.h"
#include "esp32s3_spi_timing.h"
#include "hardware/esp32s3_iomux.h"
#include "hardware/esp32s3_gpio.h"
#include "hardware/esp32s3_gpio_sigmap.h"
#include "rom/opi_flash.h"

#include "soc/spi_mem_reg.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define CORE_CLK_REG_SEL_80M    0
#define CORE_CLK_REG_SEL_120M   1
#define CORE_CLK_REG_SEL_160M   2
#define CORE_CLK_REG_SEL_240M   3

#if defined(CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR) || \
    defined(CONFIG_ESP32S3_SPIRAM_MODE_OCT)
#  define ESP32S3_SPI_TIMING_CORE_CLOCK_DIV         2
#else
#  define ESP32S3_SPI_TIMING_CORE_CLOCK_DIV         1
#endif

#if defined(CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR)
#  if defined(CONFIG_ESP32S3_FLASH_FREQ_80M)
#    define ESP32S3_SPI_TIMING_FLASH_CORE_CLK       160
#  elif defined(CONFIG_ESP32S3_FLASH_FREQ_120M)
#    define ESP32S3_SPI_TIMING_FLASH_CORE_CLK       240
#  endif
#elif defined(CONFIG_ESP32S3_FLASH_SAMPLE_MODE_STR)
#  if defined(CONFIG_ESP32S3_FLASH_FREQ_120M)
#    if ESP32S3_SPI_TIMING_CORE_CLOCK_DIV == 1
#      define ESP32S3_SPI_TIMING_FLASH_CORE_CLK     120
#    elif ESP32S3_SPI_TIMING_CORE_CLOCK_DIV == 2
#      define ESP32S3_SPI_TIMING_FLASH_CORE_CLK     240
#    endif
#  endif
#endif

#if defined(CONFIG_ESP32S3_SPIRAM_MODE_OCT)
#  if defined(CONFIG_ESP32S3_SPIRAM_SPEED_80M)
#    define ESP32S3_SPI_TIMING_PSRAM_CORE_CLK       160
#  endif
#elif defined(ESP32S3_SPI_TIMING_PSRAM_STR_MODE)
#  if defined(CONFIG_ESP32S3_SPIRAM_SPEED_120M)
#    if ESP32S3_SPI_TIMING_CORE_CLOCK_DIV == 1
#      define ESP32S3_SPI_TIMING_PSRAM_CORE_CLK     120
#    elif ESP32S3_SPI_TIMING_CORE_CLOCK_DIV == 2
#      define ESP32S3_SPI_TIMING_PSRAM_CORE_CLK     240
#    endif
#  endif
#endif

#if ESP32S3_SPI_TIMING_FLASH_TUNING
#  if ESP32S3_SPI_TIMING_PSRAM_TUNING
#    if ESP32S3_SPI_TIMING_FLASH_CORE_CLK != ESP32S3_SPI_TIMING_PSRAM_CORE_CLK
#      error "FLASH and PSRAM Mode configuration are not supported"
#    endif
#    define ESP32S3_SPI_TIMING_CORE_CLK     ESP32S3_SPI_TIMING_FLASH_CORE_CLK
#  else
#    if ESP32S3_SPI_TIMING_FLASH_CORE_CLK % ESP32S3_SPI_TIMING_PSRAM_CLOCK != 0
#      error "FLASH and PSRAM Mode configuration are not supported"
#    endif
#    define ESP32S3_SPI_TIMING_CORE_CLK     ESP32S3_SPI_TIMING_FLASH_CORE_CLK
#  endif
#else
#  if ESP32S3_SPI_TIMING_PSRAM_TUNING
#    if ESP32S3_SPI_TIMING_PSRAM_CORE_CLK % ESP32S3_SPI_TIMING_FLASH_CLOCK != 0
#      error "FLASH and PSRAM Mode configuration are not supported"
#    endif
#    define ESP32S3_SPI_TIMING_CORE_CLK     ESP32S3_SPI_TIMING_PSRAM_CORE_CLK
#  else
#    define ESP32S3_SPI_TIMING_CORE_CLK     80
#  endif
#endif

#define ESP32S3_CHECK_POWER_OF_2(n)         ((((n) & ((~(n)) + 1))) == (n))

#ifdef CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR
#  if ESP32S3_CHECK_POWER_OF_2(ESP32S3_SPI_TIMING_CORE_CLK / ESP32S3_SPI_TIMING_FLASH_CLOCK) == 0
#    error "FLASH and PSRAM Mode configuration are not supported"
#  endif
#endif

#ifdef CONFIG_ESP32S3_SPIRAM_MODE_OCT
#  if ESP32S3_CHECK_POWER_OF_2(ESP32S3_SPI_TIMING_CORE_CLK / ESP32S3_SPI_TIMING_PSRAM_CLOCK) == 0
#    error "FLASH and PSRAM Mode configuration are not supported"
#  endif
#endif

#if ESP32S3_SPI_TIMING_CORE_CLK == 80
#  define DEFAULT_CORE_CLOCK    CORE_CLOCK_80M
#  define DEFAULT_CORE_CLK_REG  CORE_CLK_REG_SEL_80M
#elif ESP32S3_SPI_TIMING_CORE_CLK == 120
#  define DEFAULT_CORE_CLOCK    CORE_CLOCK_120M
#  define DEFAULT_CORE_CLK_REG  CORE_CLK_REG_SEL_120M
#elif ESP32S3_SPI_TIMING_CORE_CLK == 160
#  define DEFAULT_CORE_CLOCK    CORE_CLOCK_160M
#  define DEFAULT_CORE_CLK_REG  CORE_CLK_REG_SEL_160M
#elif ESP32S3_SPI_TIMING_CORE_CLK == 240
#  define DEFAULT_CORE_CLOCK    CORE_CLOCK_240M
#  define DEFAULT_CORE_CLK_REG  CORE_CLK_REG_SEL_240M
#else
#  error "SPI timing core clock is invalid"
#endif

#if defined(CONFIG_ESP32S3_FLASH_FREQ_20M)
#  define FLASH_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 20)
#elif defined(CONFIG_ESP32S3_FLASH_FREQ_40M)
#  define FLASH_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 40)
#elif defined(CONFIG_ESP32S3_FLASH_FREQ_80M)
#  define FLASH_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 80)
#elif defined(CONFIG_ESP32S3_FLASH_FREQ_120M)
#  define FLASH_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 120)
#else
#  error "SPI timing flash clock is invalid"
#endif

#if defined(CONFIG_ESP32S3_SPIRAM_SPEED_40M)
#  define PSRAM_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 40)
#elif defined(CONFIG_ESP32S3_SPIRAM_SPEED_80M)
#  define PSRAM_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 80)
#elif defined(CONFIG_ESP32S3_SPIRAM_SPEED_120M)
#  define PSRAM_CLOCK_DIVIDER (ESP32S3_SPI_TIMING_CORE_CLK / 120)
#else
#  define PSRAM_CLOCK_DIVIDER 0
#endif

#define MSPI_TIMING_LL_FLASH_OCT_MASK        (SPI_MEM_FCMD_OCT | SPI_MEM_FADDR_OCT | SPI_MEM_FDIN_OCT | SPI_MEM_FDOUT_OCT)
#define MSPI_TIMING_LL_FLASH_QUAD_MASK       (SPI_MEM_FASTRD_MODE | SPI_MEM_FREAD_DUAL | SPI_MEM_FREAD_DIO | SPI_MEM_FREAD_QUAD | SPI_MEM_FREAD_QIO)
#define MSPI_TIMING_LL_FLASH_QIO_MODE_MASK   (SPI_MEM_FREAD_QIO | SPI_MEM_FASTRD_MODE)
#define MSPI_TIMING_LL_FLASH_QUAD_MODE_MASK  (SPI_MEM_FREAD_QUAD | SPI_MEM_FASTRD_MODE)
#define MSPI_TIMING_LL_FLASH_DIO_MODE_MASK   (SPI_MEM_FREAD_DIO | SPI_MEM_FASTRD_MODE)
#define MSPI_TIMING_LL_FLASH_DUAL_MODE_MASK  (SPI_MEM_FREAD_DUAL | SPI_MEM_FASTRD_MODE)
#define MSPI_TIMING_LL_FLASH_FAST_MODE_MASK  (SPI_MEM_FASTRD_MODE)

#define MSPI_TIMING_PSRAM_DTR_MODE           CONFIG_ESP32S3_SPIRAM_MODE_OCT
#define MSPI_TIMING_PSRAM_STR_MODE           !CONFIG_ESP32S3_SPIRAM_MODE_OCT
#define MSPI_TIMING_FLASH_DTR_MODE           CONFIG_ESP32S3_FLASH_SAMPLE_MODE_DTR
#define MSPI_TIMING_FLASH_STR_MODE           CONFIG_ESP32S3_FLASH_SAMPLE_MODE_STR

#define MSPI_TIMING_TEST_DATA_LEN            1024
#define MSPI_TIMING_PSRAM_TEST_DATA_ADDR     0
#define MSPI_TIMING_FLASH_TEST_DATA_ADDR     0

#define OPI_PSRAM_SYNC_READ        0x0000
#define OPI_PSRAM_SYNC_WRITE       0x8080
#define OCT_PSRAM_RD_DUMMY_NUM     (2*(10-1))
#define OCT_PSRAM_WR_DUMMY_NUM     (2*(5-1))

#define QPI_PSRAM_FAST_READ        0XEB
#define QPI_PSRAM_WRITE            0X38
#define QPI_PSRAM_FAST_READ_DUMMY  6
#define NOT_INIT_INT               127

#define g_spiflash_dummy_len_plus  (rom_spiflash_legacy_data->dummy_len_plus)

/****************************************************************************
 * Private Types
 ****************************************************************************/

