apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
      /* Enable Flash HCLK */

      REG_SET_BIT(SPI_MEM_TIMING_CALI_REG(0), SPI_MEM_TIMING_CLK_ENA);
    }
  else
    {
      /* We use SPI1 Flash to tune PSRAM, PSRAM timing related regs
       * do nothing on SPI1
       */

      set_flash_clock(1, PSRAM_CLOCK_DIVIDER);

      /* Enable PSRAM HCLK */

      REG_SET_BIT(SPI_MEM_SPI_SMEM_TIMING_CALI_REG(0),
                  SPI_MEM_SPI_SMEM_TIMING_CLK_ENA);
    }
}

/****************************************************************************
 * Name: get_dummy
 *
 * Description:
 *   Get dummy cycle length
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Dummy cycle length.
 *
 ****************************************************************************/

static uint32_t get_dummy(void)
{
  uint32_t ctrl_reg = READ_PERI_REG(SPI_MEM_CTRL_REG(0));
  if (ctrl_reg & MSPI_TIMING_LL_FLASH_OCT_MASK)
    {
      DEBUGPANIC();
      return 0;
    }

  switch (ctrl_reg & MSPI_TIMING_LL_FLASH_QUAD_MASK)
    {
      case MSPI_TIMING_LL_FLASH_QIO_MODE_MASK:
        return SPI1_R_QIO_DUMMY_CYCLELEN;
      case MSPI_TIMING_LL_FLASH_DIO_MODE_MASK:
        return SPI1_R_DIO_DUMMY_CYCLELEN;
      case MSPI_TIMING_LL_FLASH_QUAD_MODE_MASK:
      case MSPI_TIMING_LL_FLASH_DUAL_MODE_MASK:
      case MSPI_TIMING_LL_FLASH_FAST_MODE_MASK:
        return SPI1_R_FAST_DUMMY_CYCLELEN;
      default:
        DEBUGPANIC();
        return 0;
    }
}

/****************************************************************************
 * Name: set_flash_extra_dummy
 *
 * Description:
 *   Set MSPI Flash extra dummy
 *
 * Input Parameters:
 *   spi_num     - SPI0 / 1
 *   extra_dummy - extra dummy
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void set_flash_extra_dummy(uint8_t spi_num, uint8_t extra_dummy)
{
#ifdef CONFIG_ESP32S3_FLASH_MODE_OCT
  if (extra_dummy > 0)
    {
      SET_PERI_REG_MASK(SPI_MEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_TIMING_CALI_M);
      SET_PERI_REG_BITS(SPI_MEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_EXTRA_DUMMY_CYCLELEN_V,
                        extra_dummy,
                        SPI_MEM_EXTRA_DUMMY_CYCLELEN_S);
    }
  else
    {
      CLEAR_PERI_REG_MASK(SPI_MEM_TIMING_CALI_REG(spi_num),
                          SPI_MEM_TIMING_CALI_M);
      SET_PERI_REG_BITS(SPI_MEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_EXTRA_DUMMY_CYCLELEN_V, 0,
                        SPI_MEM_EXTRA_DUMMY_CYCLELEN_S);
    }

  return;
#endif
  if (g_flash_extra_dummy[spi_num] == NOT_INIT_INT)
    {
      g_flash_extra_dummy[spi_num] = g_spiflash_dummy_len_plus[spi_num];
    }

  g_spiflash_dummy_len_plus[spi_num] = g_flash_extra_dummy[(int)spi_num] +
                                       extra_dummy;

  /* Only Quad Flash will run into this branch. */

  uint32_t dummy = get_dummy();

  /* Set MSPI Quad Flash dummy */

  SET_PERI_REG_MASK(SPI_MEM_USER_REG(spi_num), SPI_MEM_USR_DUMMY);
  SET_PERI_REG_BITS(SPI_MEM_USER1_REG(spi_num), SPI_MEM_USR_DUMMY_CYCLELEN_V,
                                  dummy + g_spiflash_dummy_len_plus[spi_num],
                                  SPI_MEM_USR_DUMMY_CYCLELEN_S);
}

/****************************************************************************
 * Name: set_psram_extra_dummy
 *
 * Description:
 *   Set MSPI PSRAM extra dummy
 *
 * Input Parameters:
 *   spi_num     - SPI0 / 1
 *   extra_dummy - extra dummy
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void set_psram_extra_dummy(uint8_t spi_num, uint8_t extra_dummy)
{
#if CONFIG_ESP32S3_SPIRAM_MODE_OCT

  /* Set MSPI Octal PSRAM extra dummy */

  if (extra_dummy > 0)
    {
      SET_PERI_REG_MASK(SPI_MEM_SPI_SMEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_SPI_SMEM_TIMING_CALI_M);
      SET_PERI_REG_BITS(SPI_MEM_SPI_SMEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_V,
                        extra_dummy,
                        SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_S);
    }
  else
    {
      CLEAR_PERI_REG_MASK(SPI_MEM_SPI_SMEM_TIMING_CALI_REG(spi_num),
                          SPI_MEM_SPI_SMEM_TIMING_CALI_M);
      SET_PERI_REG_BITS(SPI_MEM_SPI_SMEM_TIMING_CALI_REG(spi_num),
                        SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_V, 0,
                        SPI_MEM_SPI_SMEM_EXTRA_DUMMY_CYCLELEN_S);
    }

#elif CONFIG_ESP32S3_SPIRAM_MODE_QUAD

  /* Set MSPI QUAD PSRAM dummy.
   * HW workaround: Use normal dummy register to set extra dummy, the
   * calibration dedicated extra dummy register doesn't work for quad mode
   */

  SET_PERI_REG_MASK(SPI_MEM_CACHE_SCTRL_REG(spi_num),
                    SPI_MEM_USR_RD_SRAM_DUMMY_M);
  SET_PERI_REG_BITS(SPI_MEM_CACHE_SCTRL_REG(spi_num),
                    SPI_MEM_SRAM_RDUMMY_CYCLELEN_V,
                   (QPI_PSRAM_FAST_READ_DUMMY + extra_dummy - 1),
                    SPI_MEM_SRAM_RDUMMY_CYCLELEN_S);
#endif
}

/****************************************************************************
 * Name: set_flash_din_mode_num
 *
 * Description:
 *   Set MSPI Flash Din Mode and Din Num
 *
 * Input Parameters:
 *   spi_num  - SPI0 / 1
 *   din_mode - Din mode
 *   din_num  - Din num
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void set_flash_din_mode_num(uint8_t spi_num, uint8_t din_mode,
                                   uint8_t din_num)
{
  /* Set MSPI Flash din mode */

  uint32_t reg_val = (getreg32(SPI_MEM_DIN_MODE_REG(spi_num)) &
      (~(SPI_MEM_DIN0_MODE_M | SPI_MEM_DIN1_MODE_M | SPI_MEM_DIN2_MODE_M |
         SPI_MEM_DIN3_MODE_M | SPI_MEM_DIN4_MODE_M | SPI_MEM_DIN5_MODE_M |
         SPI_MEM_DIN6_MODE_M | SPI_MEM_DIN7_MODE_M | SPI_MEM_DINS_MODE_M))) |
      (din_mode << SPI_MEM_DIN0_MODE_S) | (din_mode << SPI_MEM_DIN1_MODE_S) |
      (din_mode << SPI_MEM_DIN2_MODE_S) | (din_mode << SPI_MEM_DIN3_MODE_S) |
      (din_mode << SPI_MEM_DIN4_MODE_S) | (din_mode << SPI_MEM_DIN5_MODE_S) |
      (din_mode << SPI_MEM_DIN6_MODE_S) | (din_mode << SPI_MEM_DIN7_MODE_S) |
      (din_mode << SPI_MEM_DINS_MODE_S);
  putreg32(reg_val, SPI_MEM_DIN_MODE_REG(spi_num));

  /* Set MSPI Flash din num */

  reg_val = (getreg32(SPI_MEM_DIN_NUM_REG(spi_num)) &
      (~(SPI_MEM_DIN0_NUM_M | SPI_MEM_DIN1_NUM_M | SPI_MEM_DIN2_NUM_M |
         SPI_MEM_DIN3_NUM_M | SPI_MEM_DIN4_NUM_M | SPI_MEM_DIN5_NUM_M |
         SPI_MEM_DIN6_NUM_M | SPI_MEM_DIN7_NUM_M | SPI_MEM_DINS_NUM_M))) |
      (din_num << SPI_MEM_DIN0_NUM_S) | (din_num << SPI_MEM_DIN1_NUM_S) |
      (din_num << SPI_MEM_DIN2_NUM_S) | (din_num << SPI_MEM_DIN3_NUM_S) |
      (din_num << SPI_MEM_DIN4_NUM_S) | (din_num << SPI_MEM_DIN5_NUM_S) |
      (din_num << SPI_MEM_DIN6_NUM_S) | (din_num << SPI_MEM_DIN7_NUM_S) |
      (din_num << SPI_MEM_DINS_NUM_S);
  putreg32(reg_val, SPI_MEM_DIN_NUM_REG(spi_num));
}

/****************************************************************************
 * Name: set_psram_din_mode_num
 *
 * Description:
 *   Set MSPI PSRAM Din Mode and Din Num
 *
 * Input Parameters:
 *   spi_num  - SPI0 / 1
 *   din_mode - Din mode
 *   din_num  - Din num
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void set_psram_din_mode_num(uint8_t spi_num, uint8_t din_mode,
                                   uint8_t din_num)
{
  /* Set MSPI PSRAM din mode */

