apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
  uint32_t reg_val = (getreg32(SPI_MEM_SPI_SMEM_DIN_MODE_REG(spi_num)) &
      (~(SPI_MEM_SPI_SMEM_DIN0_MODE_M | SPI_MEM_SPI_SMEM_DIN1_MODE_M |
         SPI_MEM_SPI_SMEM_DIN2_MODE_M | SPI_MEM_SPI_SMEM_DIN3_MODE_M |
         SPI_MEM_SPI_SMEM_DIN4_MODE_M | SPI_MEM_SPI_SMEM_DIN5_MODE_M |
         SPI_MEM_SPI_SMEM_DIN6_MODE_M | SPI_MEM_SPI_SMEM_DIN7_MODE_M |
         SPI_MEM_SPI_SMEM_DINS_MODE_M))) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN0_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN1_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN2_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN3_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN4_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN5_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN6_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DIN7_MODE_S) |
         (din_mode << SPI_MEM_SPI_SMEM_DINS_MODE_S);
  putreg32(reg_val, SPI_MEM_SPI_SMEM_DIN_MODE_REG(spi_num));

  /* Set MSPI PSRAM din num */

  reg_val = (getreg32(SPI_MEM_SPI_SMEM_DIN_NUM_REG(spi_num)) &
      (~(SPI_MEM_SPI_SMEM_DIN0_NUM_M | SPI_MEM_SPI_SMEM_DIN1_NUM_M |
         SPI_MEM_SPI_SMEM_DIN2_NUM_M | SPI_MEM_SPI_SMEM_DIN3_NUM_M |
         SPI_MEM_SPI_SMEM_DIN4_NUM_M | SPI_MEM_SPI_SMEM_DIN5_NUM_M |
         SPI_MEM_SPI_SMEM_DIN6_NUM_M | SPI_MEM_SPI_SMEM_DIN7_NUM_M |
         SPI_MEM_SPI_SMEM_DINS_NUM_M))) |
         (din_num << SPI_MEM_SPI_SMEM_DIN0_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN1_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN2_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN3_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN4_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN5_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN6_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DIN7_NUM_S) |
         (din_num << SPI_MEM_SPI_SMEM_DINS_NUM_S);
  putreg32(reg_val, SPI_MEM_SPI_SMEM_DIN_NUM_REG(spi_num));
}

#if ESP32S3_SPI_TIMING_FLASH_TUNING

/****************************************************************************
 * Name: config_flash_read_data
 *
 * Description:
 *   Configure Flash to read data via SPI1h
 *
 * Input Parameters:
 *   buf  - data buffer pointer
 *   addr - target address value
 *   len  - data length
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void config_flash_read_data(uint8_t *buf, uint32_t addr, uint32_t len)
{
#ifdef CONFIG_ESP32S3_FLASH_MODE_OCT
  /* Clear MSPI hw fifo */

  for (int i = 0; i < 16; i++)
    {
      putreg32(0, SPI_MEM_W0_REG(1) + i * 4);
    }

  esp_rom_opiflash_read_raw(addr, buf, len);
#else
  esp_rom_spiflash_read(addr, (uint32_t *)buf, len);
#endif
}

/****************************************************************************
 * Name: config_flash_set_tuning_regs
 *
 * Description:
 *   Tune Flash timing registers for SPI1 accessing Flash
 *
 * Input Parameters:
 *   params - tuning timing parameters pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void config_flash_set_tuning_regs(const tuning_param_s *params)
{
  /* SPI_MEM_DINx_MODE(1), SPI_MEM_DINx_NUM(1) are meaningless SPI0 and SPI1
   * share SPI_MEM_DINx_MODE(0), SPI_MEM_DINx_NUM(0) for FLASH timing tuning
   * We use SPI1 to get the best Flash timing tuning (mode and num) config
   */

  set_flash_din_mode_num(0, params->spi_din_mode, params->spi_din_num);
  set_flash_extra_dummy(1, params->extra_dummy_len);
}

/****************************************************************************
 * Name: get_flash_tuning_configs
 *
 * Description:
 *   Get FLASH tuning configuration.
 *
 * Input Parameters:
 *   config - tuning timing configuration pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void get_flash_tuning_configs(tuning_config_s *config)
{
#if MSPI_TIMING_FLASH_DTR_MODE
#  define FLASH_MODE  DTR_MODE
#else
#  define FLASH_MODE  STR_MODE
#endif

#if CONFIG_ESP32S3_FLASH_FREQ_20M
    *config = MSPI_TIMING_FLASH_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 20, FLASH_MODE);
#elif CONFIG_ESP32S3_FLASH_FREQ_40M
    *config = MSPI_TIMING_FLASH_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 40, FLASH_MODE);
#elif CONFIG_ESP32S3_FLASH_FREQ_80M
    *config = MSPI_TIMING_FLASH_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 80, FLASH_MODE);
#elif CONFIG_ESP32S3_FLASH_FREQ_120M
    *config = MSPI_TIMING_FLASH_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 120, FLASH_MODE);
#endif

#undef FLASH_MODE
}
#endif

#if ESP32S3_SPI_TIMING_PSRAM_TUNING

/****************************************************************************
 * Name: psram_read_data
 *
 * Description:
 *   Configure PSRAM to read data via SPI1.
 *
 * Input Parameters:
 *   buf  - data buffer pointer
 *   addr - target address value
 *   len  - data length
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void psram_read_data(uint8_t *buf, uint32_t addr, uint32_t len)
{
#if CONFIG_ESP32S3_SPIRAM_MODE_OCT

  /* Clear MSPI hw fifo */

  for (int i = 0; i < 16; i++)
    {
      putreg32(0, SPI_MEM_W0_REG(1) + i * 4);
    }

  esp_rom_opiflash_exec_cmd(1, ESP_ROM_SPIFLASH_OPI_DTR_MODE,
                            OPI_PSRAM_SYNC_READ, 16,
                            addr, 32,
                            OCT_PSRAM_RD_DUMMY_NUM,
                            NULL, 0,
                            buf, len * 8,
                            BIT(1),
                            false);
#elif CONFIG_ESP32S3_SPIRAM_MODE_QUAD
  psram_exec_cmd(1, 0,
                 QPI_PSRAM_FAST_READ, 8,
                 addr, 24,
                 QPI_PSRAM_FAST_READ_DUMMY + g_psram_extra_dummy,
                 NULL, 0,
                 buf, len * 8,
                 SPI_MEM_CS1_DIS_M,
                 false);
#endif
}

/****************************************************************************
 * Name: psram_write_data
 *
 * Description:
 *   Configure PSRAM to write data via SPI1.
 *
 * Input Parameters:
 *   buf  - data buffer pointer
 *   addr - target address value
 *   len  - data length
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

