apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
static void psram_write_data(uint8_t *buf, uint32_t addr, uint32_t len)
{
#if CONFIG_ESP32S3_SPIRAM_MODE_OCT
  esp_rom_opiflash_exec_cmd(1, ESP_ROM_SPIFLASH_OPI_DTR_MODE,
                            OPI_PSRAM_SYNC_WRITE, 16,
                            addr, 32,
                            OCT_PSRAM_WR_DUMMY_NUM,
                            buf, len * 8,
                            NULL, 0,
                            BIT(1),
                            false);
#elif CONFIG_ESP32S3_SPIRAM_MODE_QUAD
  psram_exec_cmd(1, 0,
                 QPI_PSRAM_WRITE, 8,  /* command and command bit len */
                 addr, 24,            /* address and address bit len */
                 0,                   /* dummy bit len */
                 buf, len * 8,        /* tx data and tx bit len */
                 NULL, 0,             /* rx data and rx bit len */
                 SPI_MEM_CS1_DIS_M,   /* cs bit mask */
                 false);              /* whether is program/erase operation */
#endif
}

/****************************************************************************
 * Name: config_psram_read_write_data
 *
 * Description:
 *   Configure PSRAM to read or write data via SPI1.
 *
 * Input Parameters:
 *   buf     - data buffer pointer
 *   addr    - target address value
 *   len     - data length
 *   is_read - is read or write
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void config_psram_read_write_data(uint8_t *buf, uint32_t addr,
                                         uint32_t len, bool is_read)
{
  while (len > 0)
    {
      uint32_t length = MIN(len, 32);
      if (is_read)
        {
          psram_read_data(buf, addr, length);
        }
      else
        {
          psram_write_data(buf, addr, length);
        }

      addr += length;
      buf += length;
      len -= length;
    }
}

/****************************************************************************
 * Name: get_psram_tuning_configs
 *
 * Description:
 *   Get PSRAM tuning configuration.
 *
 * Input Parameters:
 *   config - tuning timing configuration pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void get_psram_tuning_configs(tuning_config_s *config)
{
#if MSPI_TIMING_PSRAM_DTR_MODE
#  define PSRAM_MODE  DTR_MODE
#else
#  define PSRAM_MODE  STR_MODE
#endif

#if CONFIG_ESP32S3_SPIRAM_SPEED_40M
    *config = MSPI_TIMING_PSRAM_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 40, PSRAM_MODE);
#elif CONFIG_ESP32S3_SPIRAM_SPEED_80M
    *config = MSPI_TIMING_PSRAM_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 80, PSRAM_MODE);
#elif CONFIG_ESP32S3_SPIRAM_SPEED_120M
    *config = MSPI_TIMING_PSRAM_GET_TUNING_CONFIG(
                ESP32S3_SPI_TIMING_CORE_CLK, 120, PSRAM_MODE);
#endif

#undef PSRAM_MODE
}

/****************************************************************************
 * Name: config_psram_set_tuning_regs
 *
 * Description:
 *   Tune PSRAM timing registers for SPI1 accessing PSRAM
 *
 * Input Parameters:
 *   params - tuning timing parameters pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void config_psram_set_tuning_regs(const tuning_param_s *params)
{
  /* 1. SPI_MEM_SPI_SMEM_DINx_MODE(1), SPI_MEM_SPI_SMEM_DINx_NUM(1) are
   * meaningless SPI0 and SPI1 share the SPI_MEM_SPI_SMEM_DINx_MODE(0),
   * SPI_MEM_SPI_SMEM_DINx_NUM(0) for PSRAM timing tuning
   * 2. We use SPI1 to get the best PSRAM timing tuning (mode and num) config
   */

  set_psram_din_mode_num(0, params->spi_din_mode, params->spi_din_num);
#if CONFIG_ESP32S3_SPIRAM_MODE_OCT

  /* On 728, for SPI1, flash and psram share the extra dummy register */

  set_flash_extra_dummy(1, params->extra_dummy_len);
#elif CONFIG_ESP32S3_SPIRAM_MODE_QUAD

  /* Update this `g_psram_extra_dummy`, the `psram_read_data` will
   * set dummy according to this `g_psram_extra_dummy`
   */

  g_psram_extra_dummy = params->extra_dummy_len;

  /* Set MSPI Quad Flash dummy */

  SET_PERI_REG_MASK(SPI_MEM_USER_REG(1), SPI_MEM_USR_DUMMY);
  SET_PERI_REG_BITS(SPI_MEM_USER1_REG(1), SPI_MEM_USR_DUMMY_CYCLELEN_V,
                    g_psram_extra_dummy - 1, SPI_MEM_USR_DUMMY_CYCLELEN_S);
#endif
}
#endif

/****************************************************************************
 * Name: sweep_for_success_sample_points
 *
 * Description:
 *   Use different SPI1 timing tuning config to read data to see if current
 *   MSPI sampling is successful.The sampling result will be stored in an
 *   array. In this array, successful item will be 1, failed item will be 0.
 *
 * Input Parameters:
 *   reference_data - reference data pointer
 *   config         - tuning timing configuration pointer
 *   is_flash       - is flash or not
 *   out_array      - last success point pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void sweep_for_success_sample_points(const uint8_t *reference_data,
            const tuning_config_s *config, bool is_flash, uint8_t *out_array)
{
  uint32_t config_idx = 0;
  uint8_t read_data[MSPI_TIMING_TEST_DATA_LEN];

  for (config_idx = 0; config_idx < config->config_num; config_idx++)
    {
      memset(read_data, 0, MSPI_TIMING_TEST_DATA_LEN);
#if ESP32S3_SPI_TIMING_FLASH_TUNING
      if (is_flash)
        {
          config_flash_set_tuning_regs(&(config->config_table[config_idx]));
          config_flash_read_data(read_data, MSPI_TIMING_FLASH_TEST_DATA_ADDR,
                                 sizeof(read_data));
        }
#endif

#if ESP32S3_SPI_TIMING_PSRAM_TUNING
      if (!is_flash)
        {
          config_psram_set_tuning_regs(&(config->config_table[config_idx]));
          config_psram_read_write_data(read_data,
                                       MSPI_TIMING_PSRAM_TEST_DATA_ADDR,
                                       MSPI_TIMING_TEST_DATA_LEN, true);
        }

#endif
      if (memcmp(reference_data, read_data, sizeof(read_data)) == 0)
        {
          out_array[config_idx] = 1;
          minfo("%" PRIu32 ", good\n", config_idx);
        }
      else
        {
          minfo("%" PRIu32 ", bad\n", config_idx);
        }
    }
}

/****************************************************************************
 * Name: find_max_consecutive_success_points
 *
 * Description:
 *   Find max consecutive success points.
 *
 * Input Parameters:
 *   array         - sampling results pointer
 *   size          - sampling results length
 *   out_length    - consecutive length pointer
 *   out_end_index - last success point pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void find_max_consecutive_success_points(uint8_t *array,
                uint32_t size, uint32_t *out_length, uint32_t *out_end_index)
{
  uint32_t max = 0;
  uint32_t match_num = 0;
  uint32_t i = 0;
  uint32_t end = 0;
  while (i < size)
    {
      if (array[i])
        {
          match_num++;
        }
      else
        {
          if (match_num > max)
            {
              max = match_num;
              end = i - 1;
            }

          match_num = 0;
        }

      i++;
    }

