apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
  *out_length = match_num > max ? match_num : max;
  *out_end_index = match_num == size ? size : end;
}

/****************************************************************************
 * Name: select_best_tuning_config_str
 *
 * Description:
 *   Select the STR best point
 *
 * Input Parameters:
 *   config             - tuning timing configuration pointer
 *   consecutive_length - consecutive length
 *   end                - last success point
 *
 * Returned Value:
 *   Returns the STR best point.
 *
 ****************************************************************************/

#if MSPI_TIMING_FLASH_STR_MODE || MSPI_TIMING_PSRAM_STR_MODE
static uint32_t select_best_tuning_config_str(tuning_config_s *config,
                          uint32_t consecutive_length, uint32_t end)
{
#if (ESP32S3_SPI_TIMING_CORE_CLK == 120 || ESP32S3_SPI_TIMING_CORE_CLK == 240)
  minfo("DO NOT USE FOR MASS PRODUCTION! Timing parameters may be updated");

  /* STR best point scheme */

  uint32_t best_point;
  if (consecutive_length <= 2 || consecutive_length >= 5)
    {
      /* tuning is FAIL, select default point, and generate a warning */

      best_point = config->default_config_id;
      minfo("tuning fail, best point is fallen back to index %d\n",
            best_point);
    }
  else
    {
      /* consecutive length :  3 or 4 */

      best_point = end - consecutive_length / 2;
      minfo("tuning success, best point is index %d\n", best_point);
    }

  return best_point;
#else
  /* won't reach here */

  abort();
#endif
}
#endif

/****************************************************************************
 * Name: select_best_tuning_config_dtr
 *
 * Description:
 *   Select the DTR best point
 *
 * Input Parameters:
 *   config             - tuning timing configuration pointer
 *   consecutive_length - consecutive length
 *   end                - last success point
 *
 * Returned Value:
 *   Returns the DTR best point.
 *
 ****************************************************************************/

#if MSPI_TIMING_FLASH_DTR_MODE || MSPI_TIMING_PSRAM_DTR_MODE
static uint32_t select_best_tuning_config_dtr(tuning_config_s *config,
                           uint32_t consecutive_length, uint32_t end)
{
#if (ESP32S3_SPI_TIMING_CORE_CLK == 160)

  /* Core clock 160M DTR best point scheme */

  uint32_t best_point;

  /* These numbers will probably be same on other chips,
   * if this version of algorithm is utilised
   */

  if (consecutive_length <= 2 || consecutive_length >= 6)
    {
      /* tuning is FAIL, select default point, and generate a warning */

      best_point = config->default_config_id;
      minfo("tuning fail, best point is fallen back to index %" PRIu32 "\n",
            best_point);
    }
  else if (consecutive_length <= 4)
    {
      /* consecutive length :  3 or 4 */

      best_point = end - 1;
      minfo("tuning success, best point is index %" PRIu32 "\n", best_point);
    }
  else
    {
      /* consecutive point list length equals 5 */

      best_point = end - 2;
      minfo("tuning success, best point is index %" PRIu32 "\n", best_point);
    }

  return best_point;
#else
  /* won't reach here */

  abort();
#endif
}
#endif

/****************************************************************************
 * Name: select_best_tuning_config
 *
 * Description:
 *   Select the best timing tuning configuration
 *
 * Input Parameters:
 *   config             - tuning timing configuration pointer
 *   consecutive_length - consecutive length
 *   end                - last success point
 *   reference_data     - reference data pointer
 *   is_flash           - is flash or not
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void select_best_tuning_config(tuning_config_s *config,
                    uint32_t consecutive_length, uint32_t end,
                    const uint8_t *reference_data, bool is_flash)
{
  uint32_t best_point = 0;
  if (is_flash)
    {
#if MSPI_TIMING_FLASH_DTR_MODE
      best_point = select_best_tuning_config_dtr(config, consecutive_length,
                                                 end);
#elif MSPI_TIMING_FLASH_STR_MODE
      best_point = select_best_tuning_config_str(config, consecutive_length,
                                                 end);
#endif
      g_flash_timing_tuning_config = config->config_table[best_point];
      minfo("Flash timing tuning index: %" PRIu32 "\n", best_point);
    }
  else
    {
#if MSPI_TIMING_PSRAM_DTR_MODE
      best_point = select_best_tuning_config_dtr(config, consecutive_length,
                                                 end);
#elif MSPI_TIMING_PSRAM_STR_MODE
      best_point = select_best_tuning_config_str(config, consecutive_length,
                                                 end);
#endif
      g_psram_timing_tuning_config = config->config_table[best_point];
      minfo("PSRAM timing tuning index: %" PRIu32 "\n", best_point);
    }
}

/****************************************************************************
 * Name: set_timing_tuning_regs
 *
 * Description:
 *   Set timing tuning registers
 *
 * Input Parameters:
 *   spi1 - Select whether to control SPI1
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void set_timing_tuning_regs(bool control_spi1)
{
  /* SPI0 and SPI1 share the registers for flash din mode and num setting,
   * so we only set SPI0's reg
   */

  set_flash_din_mode_num(0, g_flash_timing_tuning_config.spi_din_mode,
                          g_flash_timing_tuning_config.spi_din_num);
  set_flash_extra_dummy(0, g_flash_timing_tuning_config.extra_dummy_len);
  if (control_spi1)
    {
      set_flash_extra_dummy(1, g_flash_timing_tuning_config.extra_dummy_len);
    }

  set_psram_din_mode_num(0, g_psram_timing_tuning_config.spi_din_mode,
                         g_psram_timing_tuning_config.spi_din_num);
  set_psram_extra_dummy(0, g_psram_timing_tuning_config.extra_dummy_len);
}

/****************************************************************************
 * Name: clear_timing_tuning_regs
 *
 * Description:
 *   Clear timing tuning registers
 *
 * Input Parameters:
 *   spi1 - Select whether to control SPI1
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void clear_timing_tuning_regs(bool control_spi1)
{
  /* SPI0 and SPI1 share the registers for flash din mode and num setting,
   * so we only set SPI0's reg
   */

