apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
  set_flash_din_mode_num(0, 0, 0);
  set_flash_extra_dummy(0, 0);
  if (control_spi1)
    {
      set_flash_extra_dummy(1, 0);
    }

  set_psram_din_mode_num(0, 0, 0);
  set_psram_extra_dummy(0, 0);
}

/****************************************************************************
 * Name: do_tuning
 *
 * Description:
 *   Start to tune the timing:
 *
 * Input Parameters:
 *   reference_data - reference data pointer
 *   timing_config  - tuning timing configuration pointer
 *   is_flash       - is flash or not
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void do_tuning(const uint8_t *reference_data,
                tuning_config_s *timing_config, bool is_flash)
{
  /* We use SPI1 to tune the timing:
   * 1. Get all SPI1 sampling results.
   * 2. Find the longest consecutive successful sampling points.
   * 3. The middle one will be the best sampling point.
   */

  uint32_t consecutive_length = 0;
  uint32_t last_success_point = 0;
  uint8_t sample_result[MSPI_TIMING_CONFIG_NUM_DEFAULT] =
    {
      0
    };

  init_spi1_for_tuning(is_flash);
  sweep_for_success_sample_points(reference_data, timing_config, is_flash,
                                  sample_result);
  find_max_consecutive_success_points(sample_result,
  MSPI_TIMING_CONFIG_NUM_DEFAULT, &consecutive_length, &last_success_point);
  select_best_tuning_config(timing_config, consecutive_length,
                            last_success_point, reference_data, is_flash);
}

#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_spi_timing_set_pin_drive_strength
 *
 * Description:
 *   Make SPI all GPIO strength to be 3 under default clock.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_spi_timing_set_pin_drive_strength(void)
{
  const uint32_t regs[] =
    {
      IO_MUX_GPIO27_REG,
      IO_MUX_GPIO28_REG,
      IO_MUX_GPIO31_REG,
      IO_MUX_GPIO32_REG,
      IO_MUX_GPIO33_REG,
      IO_MUX_GPIO34_REG,
      IO_MUX_GPIO35_REG,
      IO_MUX_GPIO36_REG,
      IO_MUX_GPIO37_REG
    };

  /* Set default clock */

  SET_PERI_REG_MASK(SPI_MEM_DATE_REG(0), SPI_MEM_SPICLK_PAD_DRV_CTL_EN);
  REG_SET_FIELD(SPI_MEM_DATE_REG(0), SPI_MEM_SPI_SMEM_SPICLK_FUN_DRV, 3);
  REG_SET_FIELD(SPI_MEM_DATE_REG(0), SPI_MEM_SPI_FMEM_SPICLK_FUN_DRV, 3);

  /* Set default mspi d0 ~ d7, dqs pin drive strength */

  for (int i = 0; i < nitems(regs); i++)
    {
      PIN_SET_DRV(regs[i], 3);
    }
}

/****************************************************************************
 * Name: esp32s3_spi_timing_set_mspi_high_speed
 *
 * Description:
 *   Make MSPI work under the frequency as users set, may add certain
 *   delays to MSPI RX direction to meet timing requirements.
 *
 * Input Parameters:
 *   spi1 - Select whether to control SPI1
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_spi_timing_set_mspi_high_speed(bool spi1)
{
  uint32_t flash_div = FLASH_CLOCK_DIVIDER;
  uint32_t psram_div = PSRAM_CLOCK_DIVIDER;

  /* Set SPI0 & 1 core clock */

  REG_SET_FIELD(SPI_MEM_CORE_CLK_SEL_REG(0),
                SPI_MEM_CORE_CLK_SEL,
                DEFAULT_CORE_CLK_REG);

  set_flash_clock(0, flash_div);
  if (spi1)
    {
      set_flash_clock(1, flash_div);
    }

  set_psram_clock(0, psram_div);

#if ESP32S3_SPI_TIMING_FLASH_TUNING || ESP32S3_SPI_TIMING_PSRAM_TUNING
  set_timing_tuning_regs(true);
#endif
}

/****************************************************************************
 * Name: esp32s3_spi_timing_set_mspi_low_speed
 *
 * Description:
 *   Make MSPI work under 20MHz and remove the timing tuning required delays.
 *
 * Input Parameters:
 *   spi1 - Select whether to control SPI1
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_spi_timing_set_mspi_low_speed(bool spi1)
{
  /* Here we are going to set the SPI1 frequency to be 20MHz,
   * so we need to set SPI1 din_num and din_mode regs.
   *
   * Because SPI0 and SPI1 share the din_num and din_mode regs,
   * but if we clear SPI1 din_num and din_mode to 0 and SPI0 flash
   * module clock is still in high freq, it may not work correctly.
   *
   * Therefore, we need to set both the SPI0 and SPI1 and related
   * timing tuning regs to be 20MHz.
   */

  /* Set SPIMEM core clock as 80MHz, and set SPI1 and SPI0 clock
   * to be 20MHz by setting clock division as 4
   */

  REG_SET_FIELD(SPI_MEM_CORE_CLK_SEL_REG(0),
                SPI_MEM_CORE_CLK_SEL,
                CORE_CLK_REG_SEL_80M);

  set_flash_clock(0, 4);
  if (spi1)
    {
      /* After tuning, won't touch SPI1 again */

      set_flash_clock(1, 4);
    }

  set_psram_clock(0, 4);

#if ESP32S3_SPI_TIMING_FLASH_TUNING || ESP32S3_SPI_TIMING_PSRAM_TUNING
  clear_timing_tuning_regs(spi1);
#endif
}

/****************************************************************************
 * Name: esp32s3_spi_timing_set_mspi_psram_tuning
 *
 * Description:
 *   Tune MSPI psram timing to make it work under high frequency
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_spi_timing_set_mspi_psram_tuning(void)
{
#if ESP32S3_SPI_TIMING_PSRAM_TUNING
  tuning_config_s timing_configs =
    {
      0
    };

  /* set SPI01 related regs to 20mhz configuration, to write reference data
   * to PSRAM.
   */

  esp32s3_spi_timing_set_mspi_low_speed(true);

  /* write data into psram, used to do timing tuning test. */

  uint8_t reference_data[MSPI_TIMING_TEST_DATA_LEN];
  for (int i = 0; i < MSPI_TIMING_TEST_DATA_LEN / 4; i++)
    {
      ((uint32_t *)reference_data)[i] = 0xa5ff005a;
    }

