apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi_timing.c
  config_psram_read_write_data(reference_data,
  MSPI_TIMING_PSRAM_TEST_DATA_ADDR, MSPI_TIMING_TEST_DATA_LEN, false);

  get_psram_tuning_configs(&timing_configs);

  /* Disable the variable dummy mode when doing timing tuning */

  REG_SET_FIELD(SPI_MEM_DDR_REG(1), SPI_MEM_SPI_FMEM_VAR_DUMMY, false);

  /* Get required config, and set them to PSRAM related registers */

  do_tuning(reference_data, &timing_configs, false);
  esp32s3_spi_timing_set_mspi_high_speed(true);
#endif
}

/****************************************************************************
 * Name: esp32s3_spi_timing_set_mspi_flash_tuning
 *
 * Description:
 *   Tune MSPI flash timing to make it work under high frequency
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void IRAM_ATTR esp32s3_spi_timing_set_mspi_flash_tuning(void)
{
#if ESP32S3_SPI_TIMING_FLASH_TUNING
  tuning_config_s timing_configs =
    {
      0
    };

  /* set SPI01 related regs to 20mhz configuration, to get reference data
   * from FLASH.
   */

  esp32s3_spi_timing_set_mspi_low_speed(true);

  /* Disable the variable dummy mode when doing timing tuning. */

  REG_SET_FIELD(SPI_MEM_DDR_REG(1), SPI_MEM_SPI_FMEM_VAR_DUMMY, false);
  uint8_t reference_data[MSPI_TIMING_TEST_DATA_LEN] =
    {
      0
    };

  config_flash_read_data(reference_data, MSPI_TIMING_FLASH_TEST_DATA_ADDR,
                         sizeof(reference_data));
  get_flash_tuning_configs(&timing_configs);
  do_tuning(reference_data, &timing_configs, true);
  esp32s3_spi_timing_set_mspi_high_speed(true);
#endif
}
